Revit 2025 API
StairsEndNotchOption Enumeration
 The style of notch width for the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StairsEndNotchOption
Public Enumeration StairsEndNotchOption
public enum class StairsEndNotchOption
type StairsEndNotchOption
Members
Member name | Value | Description
FullRunWidth | 0 |  The notch width is the run width.
Custom | 1 |  The notch width is customized by user.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace